InformationRegisters/ЗадачиИнтернетЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиИнтернетЗаявки</Name>
			<Comment>Задачи по интернет-зявкам: Реестр</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было получено обращение на автозвонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура интернет-заявки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьАвтозвонок</Name>
					<Comment>Выполнить действительно звонок автоматически из консоли</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Comment>Необходимо для разблокировки открытых заблокированных задач более нормативного времени блокировки </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПереводыЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПереводыЗвонков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеОчереди</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/КонтактЦентрСервер/Ext/Module.bsl
Функция ПоставьЗадачуСвободномуОператору(НомерОператора) Экспорт
		//На входе номер телефона свободного оператора КЦ
		// На выходе номер телефона абонента, ожидающего автозвонок и сигнатура интернет-заявки
		  
	  Доступно = ТипЗнч(НомерОператора) = Тип("Строка") И СтрДлина(НомерОператора); 
	  
	  Если Не Доступно Тогда
		  ЗаписьЖурналаРегистрации("КонтактЦентрСервер.ПоставьЗадачуСвободномуОператору", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("НомерОператора = %1", НомерОператора), "Ошибка в типе или заполнении аргументов");
		  Результат = Новый Структура("Телефон, Сигнатура", "", "");
		  Возврат Результат;
	  КонецЕсли;
	  
	  ТелефонИСигнатураОткрытойЗадачи = РегистрыСведений.ЗадачиИнтернетЗаявки.НайдиИЗаблокируйПервуюОткрытуюЗадачу_ДляВыполненияЗвонка(НомерОператора);
	  
	  Возврат  ТелефонИСигнатураОткрытойЗадачи;	   
	    
 КонецФункции
    
Функция ПереводЗвонка(Оператор, Направление) Экспорт
	//Добавляет запись в регистр сведений "Переводы звонков"
	// Параметры: Оператор - текущий пользователь, оператор контакт-центра, Направление  - внутренний телефон, телефонная очередь, виртуальная телефонная очередь
	
	ТекДата = ТекущаяДата();
	МЗ = РегистрыСведений.ПереводыЗвонков.СоздатьМенеджерЗаписи();
	МЗ.Период 	   = ТекДата;
	МЗ.Оператор    = Оператор;
	МЗ.Направление = Направление;
	МЗ.Количество  = 1;
	Попытка
		МЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Перевод звонка записать", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Период = %1, Оператор = %2, Направление = %3", ТекДата, Оператор, Направление), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецФункции
 
Функция ВнутренниеТелефоныКроме(ИсключиНомер = "") Экспорт
	//Возвращает массив всех внутренних телефонов, ислючая заданные номер ИсключиНомер    
	
	Доступно = ТипЗнч(ИсключиНомер) = Тип("Строка");
	Если Не Доступно Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Код ИЗ Справочник.ТелВнутренние ГДЕ Код <> &Код");
	Запрос.УстановитьПараметр("Код", ИсключиНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Новый Массив();
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	Возврат Результат;
 КонецФункции
 
#Область Команды_телефонии_через_Rest_API_для_ВэбКлиента
Функция _ВыполнитьКоманду(ТекстКоманды) Экспорт	
	Соединение 	= Новый HTTPСоединение("192.168.0.137", 8084);
	Запрос 		= Новый HTTPЗапрос("/ami/action"+ТекстКоманды);
	Запрос.Заголовки.Вставить("Par1", ТекстКоманды);
	HTTPОтвет = Соединение.Post(Запрос);
КонецФункции
#КонецОбласти
